Revit 2027 API
ElectricalSystem.TrueCurrentPhaseB Property
 The TrueCurrentPhaseB value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TrueCurrentPhaseB { get; }
Public ReadOnly Property TrueCurrentPhaseB As Double
	Get
public:
property double TrueCurrentPhaseB {
	double get ();
}
member TrueCurrentPhaseB : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the TrueCurrentPhaseB value of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace